БухЭксп/InformationRegisters/CW_ПризнакНаличияОригиналовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакНаличияОригиналовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОригиналыПредоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОтсутствующиеОригиналыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОтсутствующиеОригиналыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПоследниеИспользованныеДоговоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПоследниеИспользованныеДоговоры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СрокиОплатыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СрокиОплатыСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрГрузоперевозки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДанныеПлатежногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДанныеПлатежногоКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлатежныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокРасчетаДляУсловияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокРасчетаДляУсловияОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыПолученияПередачиСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсрочкаОтДатыВозвратаАкта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_Документы/Ext/Module.bsl
// ---------------------------------------------------------------------------- 
// ДОКУМЕНТЫ
// ----------------------------------------------------------------------------

#Область НомераДокументов 

Функция ПроверкаНомера(Документ, РежимЗаписи, ВедущийДокумент ,Отказ) Экспорт
	
	Попытка
		Документ.Записать(РежимЗаписи); 
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать документ """+Строка(Документ)+""". По причине: "+ ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Если (НЕ ТранзакцияАктивна()) Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
		
		Отказ = Истина;
	КонецПопытки;
	
	Возврат(Отказ);
КонецФункции

// --- 
Функция ПрефиксОрганизации(Организация) Экспорт 
	// --- 
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
	ПрефиксИнформационнойБазы = ?(ПрефиксИнформационнойБазы = "","00",ПрефиксИнформационнойБазы);

	ПрефиксОрганизации        	= Организация.Префикс;
	
	ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	
	// --- 
	ШаблонПрефикса = "[ОР][ИБ]-";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	// --- 
	Возврат(ШаблонПрефикса);
	
	// --- 
КонецФункции


Функция ПолучитьНомерНаПечать(Документ, ИмяРеквизитаНомер="Номер", ИмяРеквизитаДата="Дата") Экспорт 

	// На входе документ - объект, ссылка или структура, обязательно с полем "Организация", 
	Организация = Документ.Организация;
	
	// и с полем номера, по умлочанию "Номер", конкретное имя реквизита можно уточнить
	Номер = СокрЛП(Документ[ИмяРеквизитаНомер]);
	
	// если это документ, то дата всегда есть, но на случай структуры придётся проверить
	Если ТипЗнч(Документ)=Тип("Структура") И НЕ Документ.Свойство("Дата") Тогда 
		Дата = ТекущаяДата();
	Иначе 
		Дата = Документ[ИмяРеквизитаДата];
	КонецЕсли;
	
	// проверим на наличие опции вывода на печать полного номера 
	ВыводитьНаПечатьПолныйНомерДокумента = ложь;
	Если ЗначениеЗаполнено(Организация) и Дата <> Дата(1,1,1) Тогда
		ВыводитьНаПечатьПолныйНомерДокумента = CW_Настройки.ПараметрУчетнойПолитики(Дата, Организация, "ВыводитьНаПечатьПолныйНомерДокумента");
		Если ВыводитьНаПечатьПолныйНомерДокумента Тогда 
			Возврат Номер;
		КонецЕсли;                                                     
	КонецЕсли;
	
	// попытаемся найти позицию дефиса и если его найдем,
	// то все что будет левее этой позиции будем считать префиксом,
	// с которым нужно будет разобраться подлежит он выводу на печать или нет.
	ПозицияДефиса 	= СтрНайти(Номер,"-");
	Если ПозицияДефиса > 0 Тогда
		
		// исходный префикс - то, что до символа "-"
		ПрефиксНомера 	= Лев(Номер,ПозицияДефиса);
		
		// это остаток номера, который нужно вывести на печать в любом случае
		Номер = Сред(Номер,ПозицияДефиса + 1);
		
		ПрефиксИнформационнойБазы 	= "";
		ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
		
		ПолныйПрефиксПоШаблону 		= ПрефиксОрганизации(Организация);
		СтрокаПрефиксОрганизации 	= ?(Организация.Префикс 		= "","00", Организация.Префикс);
		ПрефиксИнформационнойБазы 	= ?(ПрефиксИнформационнойБазы 	= "","00",ПрефиксИнформационнойБазы) + "-";
		
		ВсеНули 		= Лев("00000000",ПозицияДефиса-1)+"-";
		
		// пытаемся вырезать стандартный префикс
		НовыйПрефиксНомера = СтрЗаменить(ПрефиксНомера, ПолныйПрефиксПоШаблону, "");
		
		// пытаемся вырезать префикс, состоящий из нулей
		НовыйПрефиксНомера = СтрЗаменить(НовыйПрефиксНомера, ВсеНули, "");
		
		// если длина префикса равна или превышает 5 символов, то есть основания 
		// полагать, что он сформирован по шаблону типовой конфигурации
		Если ПозицияДефиса >= 5 Тогда
			
			// если первые 2 символа совпадают с префиксом организации, то обрезаем их
			Если Лев(НовыйПрефиксНомера,2) =  СтрокаПрефиксОрганизации Тогда
				НовыйПрефиксНомера = Сред(НовыйПрефиксНомера,3);
			КонецЕсли;
			
			// если последние 3 символа совпадают с префиксом ИБ или с пустым префиксом ИБ 
			// (условие на тот случай если с некоторого момента времени префикс ИБ был добавлен),
			// то обрезаем их
			Если Прав(НовыйПрефиксНомера,3) = ПрефиксИнформационнойБазы  Тогда
				НовыйПрефиксНомера = СтрЗаменить(НовыйПрефиксНомера	, ПрефиксИнформационнойБазы, "");
			КонецЕсли;
			
			Если Прав(НовыйПрефиксНомера,3) = "00-" Тогда
				НовыйПрефиксНомера = СтрЗаменить(НовыйПрефиксНомера	, "00-", "");
			КонецЕсли;
			
			// если в оставшейся части в префиксе найдем букву, то такой префикс
			// не подлежит выводу на печать, т.к. мог быть получен в результате 
			// смены префикса организации
			СтрокаЧисел	 	= "0123456789";
			ЧислоСимволов 	=  СтрДлина(НовыйПрефиксНомера)-1;
			Для поз = 1 по ЧислоСимволов Цикл
				ТекущийСимвол = Сред(НовыйПрефиксНомера,Поз,1);
				Если СтрНайти(СтрокаЧисел, ТекущийСимвол) = 0 Тогда
					НовыйПрефиксНомера = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		// если изначальный префикс меньше 5 символов, то считаем такой префикс
		// не подлежащий выводу на печать (префикс, который мог быть сформирован в старом формате)
		Иначе
			НовыйПрефиксНомера = "";
		КонецЕсли;
		
	// если "-" не нашли, то попытаемся "вырезать" из номера префикс
 	ИначеЕсли СтрНайти(Номер, Организация.Префикс) = 1 Тогда

       Номер = СтрЗаменить(Номер,Организация.Префикс,"");
       НовыйПрефиксНомера = "";    
	
	// если в исходном номере не было "-"	
	Иначе 
		НовыйПрефиксНомера = "";	
	КонецЕсли;
	
	// если префикс пустой, то попытаемся убрать ведущие нули
	Если СокрЛП(НовыйПрефиксНомера) = "" Тогда
		Пока Лев(Номер, 1) = "0" Цикл
			Номер = Сред(Номер, 2);  
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СокрЛП(НовыйПрефиксНомера) + Номер;
КонецФункции

Процедура ДополнитьСтрокуНулямиСлева(Строка, ДлинаСтроки)
	
	// ВызовБП
	Строка = _сф.стр_ДополнитьСтроку(Строка, ДлинаСтроки, "0", "Слева");
	
КонецПроцедуры

#КонецОбласти 

#Область ДатыДокументов 

Функция РабочееВремя() Экспорт
	// --- 
	
	ДатаСтрокой = Формат(ПолучитьРабочуюДату(),"ДФ=yyyyMMdd");
	ВремяСтрокой = Формат(ТекущаяДата(),"ДФ=HHmmss");
	мНоваяДата = Дата(ДатаСтрокой+ВремяСтрокой);
	// --- 
	Возврат(мНоваяДата);
	
	// --- 
КонецФункции

Функция ПолучитьРабочуюДату() Экспорт 
	// --- 
	
	Возврат(ОбщегоНазначенияБП.ПолучитьРабочуюДату()); // ВызовБП 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область СвязиДокументов

Функция ПолучитьВедущийДокумент(ВедомыйДокумент) Экспорт 
	// --- 
	
	Если ТипЗнч(ВедомыйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент";
					   
		Запрос.УстановитьПараметр("ВедомыйДокумент", ВедомыйДокумент);
		ТЗ = Запрос.Выполнить().Выгрузить();
        Если ТЗ.Количество() <> 0 Тогда
			
			Возврат(_сф.к_ПервыйЭлемент(ТЗ).Ссылка);
			
		Иначе
			
			Возврат(Неопределено);
			
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ВедомыйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_РасходыПоГрузоперевозке.Ссылка
		|ИЗ
		|	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
		|ГДЕ
		|	CW_РасходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент";
		Запрос.УстановитьПараметр("ВедомыйДокумент", ВедомыйДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Возврат(Выборка.Ссылка);
			
		Иначе
			
			Возврат(Неопределено);
			
		КонецЕсли; 
		
	ИначеЕсли (ТипЗнч(ВедомыйДокумент) = Тип("ДокументСсылка.КорректировкаПоступления")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_РасходыПоГрузоперевозке.Ссылка
		               |ИЗ
		               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
		               |ГДЕ
		               |	CW_РасходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ВедомыйДокумент";
		Запрос.УстановитьПараметр("ВедомыйДокумент", ВедомыйДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Возврат(Выборка.Ссылка);
			
		Иначе
			
			Возврат(Неопределено);
			
		КонецЕсли;
		
	ИначеЕсли (ТипЗнч(ВедомыйДокумент) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозке.Ссылка
		               |ИЗ
		               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ВедомыйДокумент";
		Запрос.УстановитьПараметр("ВедомыйДокумент", ВедомыйДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Возврат(Выборка.Ссылка);
			
		Иначе
			
			Возврат(Неопределено);
			
		КонецЕсли;
		
	Иначе
		
		Возврат(Неопределено);
		
	КонецЕсли; 
		
	// --- 
КонецФункции

#КонецОбласти 

#Область ВидФормы 

Процедура ОпределитьВозможностьОткрытияОбъектаМодуля(ТипИсточника=Неопределено, Грузоперевозка=Неопределено, Отказ) Экспорт

	CW_ПроверкаЛицензии.УстановитьОбщиеПараметрыМодуля();

	Если ТипИсточника = Неопределено Тогда  
		//Тип документа не передан
		Возврат;
	КонецЕсли;     
	
	СоответствиеРолей 	= ПолучитьСоответствиеПравГруппыПользователейТипуДокумента();
	ПроверяемаяРоль 	= СоответствиеРолей.Получить(ТипИсточника); 
	Если ПроверяемаяРоль <> Неопределено Тогда
		ПравоДоступно = CW_ПраваДоступа.ПравоДоступно(ПроверяемаяРоль);
		Если Не ПравоДоступно Тогда
			Отказ = Истина;
			ВызватьИсключение "Недостаточно прав для просмотра.";
		КонецЕсли;
	КонецЕсли;
	
	Если ТипИсточника = Тип("СправочникМенеджер.CW_Грузоперевозки") 
		и ТипЗнч(Грузоперевозка) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());	
		Если Не ГруппаПользователя.ПолныеПрава и ГруппаПользователя.ФильтрГрузоперевозок Тогда
			ФильтрГрузоперевозок 	=  ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить();
			ПроверкаВыполнена 		= CW_Мониторинг.ВыполнитьПроверкуДополнительногоКонтроля(ФильтрГрузоперевозок, Грузоперевозка);
			Если Не ПроверкаВыполнена Тогда
				Отказ = Истина;
				ВызватьИсключение "Недостаточно прав для просмотра.";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьСоответствиеПравГруппыПользователейТипуДокумента()
	
	СоответствиеРолей = Новый Соответствие;
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_ДоходыПоГрузоперевозке"), 	"ПросмотрФинансов_Доходы");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_РасходыПоГрузоперевозке"), 	"ПросмотрФинансов_Расходы");
	
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_ЗакрытиеГрузоперевозки"), 	"ПросмотрФинансов");   
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_ПрайсКонтрагента"), 		"ПросмотрФинансов");
	
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_КорректировкаОперативнойЗадолженности"), 	"ПросмотрФинансов_ОперативныйУчет");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_КорректировкаРаспределенияОплатДляУСН"), 	"ПросмотрФинансов_ОперативныйУчет");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_Оплата"), 									"ПросмотрФинансов_ОперативныйУчет");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.ПоступлениеНаРасчетныйСчет"), 					"ПросмотрФинансов_ОперативныйУчет");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_ДвижениеДенежныхСредств"), 					"ПросмотрФинансов_ОперативныйУчет");
	СоответствиеРолей.Вставить(Тип("ДокументМенеджер.CW_КорректировкаАктированияСчетов"), 			"ПросмотрФинансов_ОперативныйУчет");
	
	Возврат СоответствиеРолей;

КонецФункции  

Процедура ОтображениеКнопокКоманднойПанелиФормыСписка(Форма) Экспорт 
	// --- 
	
	СОК = Новый Соответствие;
	СОК.Вставить("Выбрать", ОтображениеКнопки.Текст);
	СОК.Вставить("Добавить", ОтображениеКнопки.Картинка);
	СОК.Вставить("Скопировать", ОтображениеКнопки.Картинка);
	СОК.Вставить("Изменить", ОтображениеКнопки.Картинка);
	СОК.Вставить("УстановитьПометкуУдаления", ОтображениеКнопки.Картинка);
	// --- 
	СОК.Вставить("УстановитьИнтервал", ОтображениеКнопки.Картинка);
	// --- 
	СОК.Вставить("Найти", ОтображениеКнопки.КартинкаИТекст);
	СОК.Вставить("ОтменитьПоиск", ОтображениеКнопки.Картинка);
	// --- 
	СОК.Вставить("Провести", ОтображениеКнопки.Картинка);
	СОК.Вставить("ОтменаПроведения", ОтображениеКнопки.Картинка);
	СОК.Вставить("ОбщаяКомандаCW_ДвиженияДокумента", ОтображениеКнопки.Картинка);
	// --- 
	СОК.Вставить("НастройкаСписка", ОтображениеКнопки.Картинка);
	СОК.Вставить("ОтборСортировка", ОтображениеКнопки.Картинка);
	СОК.Вставить("ВывестиСписок", ОтображениеКнопки.Картинка);
	// --- 
	СОК.Вставить("Обновить", ОтображениеКнопки.Картинка);
	
	
	Для каждого Элемент Из Форма.Элементы Цикл
		
		Если (ТипЗнч(Элемент) = Тип("КнопкаФормы")) Тогда
			
			Если (Найти(Элемент.Имя,"Форма") <> 0) Тогда
				
				Элемент.ТолькоВоВсехДействиях = Ложь;
				
				ИмяЭлемента = Элемент.Имя;
				ИмяКоманды = СтрЗаменить(ИмяЭлемента,"Форма","");
				
				Отображение = СОК.Получить(ИмяКоманды);
				Если (Отображение <> Неопределено) Тогда
					Элемент.Отображение = Отображение;
				Иначе
					Элемент.Отображение = ОтображениеКнопки.Картинка;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ОригиналыДокументов 

Функция ПодготовитьСтруктуруДляЗаписиналичияОригиналовДокументов(ДанныеДлязаписи) Экспорт
	
	УстанавливатьПризнакНаличия = Константы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Получить();
	
	СтруктураПараметров = Новый Структура("Ссылка,Признак,ДатаВозврата,Организация,Контрагент,Договор,ВедомыйДокумент,ДатаСчета,Счет,Акт",
											ДанныеДлязаписи.Ссылка,
											ДанныеДлязаписи.Признак,
											ДанныеДлязаписи.ДатаВозврата,
											Неопределено,
											Неопределено,
											Неопределено,
											Неопределено,
											Дата(1,1,1),
											ложь,
											ложь);
	
											
	// получим данные документа
	Если ТипЗнч(ДанныеДлязаписи.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		ПолеСчет 	= "ФормируетсяСчет";
		ПолеАкт 	= "ФормируетсяАкт";
		ИмяТаблицы 	= "CW_ДоходыПоГрузоперевозке";
	Иначе
		ПолеСчет 	= "ПредъявленСчет";
		ПолеАкт 	= "ПредъявленАкт";
		ИмяТаблицы 	= "CW_РасходыПоГрузоперевозке";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ТекущийДокумент.Ссылка КАК Ссылка,
					|	ТекущийДокумент.Организация КАК Организация,
					|	ТекущийДокумент.Контрагент КАК Контрагент,
					|	ТекущийДокумент.Договор КАК Договор,
					|	ТекущийДокумент.ВедомыйДокумент КАК ВедомыйДокумент,
					|	ТекущийДокумент.ДатаСчета КАК ДатаСчета,
					|	ТекущийДокумент."+ПолеСчет+" КАК Счет,
					|	ТекущийДокумент."+ПолеАкт+" КАК Акт
					|ИЗ
					|	Документ."+ИмяТаблицы+" КАК ТекущийДокумент
					|ГДЕ
					|	ТекущийДокумент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДлязаписи.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров,Выборка);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Документ) Экспорт 
	
	СтруктураДанных = Новый Структура("ОригиналыПредоставлены,ДатаПолучения", Ложь, Дата(1,1,1)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПризнакНаличияОригиналовДокументов.ДокументСсылка КАК ДокументСсылка,
	               |	CW_ПризнакНаличияОригиналовДокументов.ОригиналыПредоставлены КАК ОригиналыПредоставлены,
	               |	CW_ПризнакНаличияОригиналовДокументов.ДатаПолучения КАК ДатаПолучения
	               |ИЗ
	               |	РегистрСведений.CW_ПризнакНаличияОригиналовДокументов КАК CW_ПризнакНаличияОригиналовДокументов
	               |ГДЕ
	               |	CW_ПризнакНаличияОригиналовДокументов.ДокументСсылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Документ);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

//Функция УстановитьПризнакНаличияиДатуВозвартаОригиналов(СтруктураПараметров) Экспорт 
Функция УстановитьПризнакНаличияИдатуВозвратаОригиналов(СтруктураПараметров) Экспорт 
	
	//Отсутствующие оригиналы документов
	НаборЗаписей = РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Значение 		= СтруктураПараметров.Ссылка;
	НаборЗаписей.Отбор.Документ.Использование 	= Истина;
	НаборЗаписей.Очистить();
	
	Если НЕ СтруктураПараметров.Признак Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Документ 	= СтруктураПараметров.Ссылка;
		Запись.Организация 	= СтруктураПараметров.Организация;
		Запись.Контрагент 	= СтруктураПараметров.Контрагент;
		Запись.Договор 		= СтруктураПараметров.Договор;
	КонецЕсли; 
	
	НаборЗаписей.Записать(Истина);
	
	//Признак наличия оригиналов документо
	НаборНаличияОригиналов = РегистрыСведений.CW_ПризнакНаличияОригиналовДокументов.СоздатьНаборЗаписей();
	НаборНаличияОригиналов.Отбор.ДокументСсылка.Установить(СтруктураПараметров.Ссылка);
	НаборНаличияОригиналов.Очистить();
	
	Запись = НаборНаличияОригиналов.Добавить();
	Запись.ДокументСсылка 			= СтруктураПараметров.Ссылка;
	Запись.ОригиналыПредоставлены 	= СтруктураПараметров.Признак;
	Запись.ДатаПолучения 			= СтруктураПараметров.ДатаВозврата;
	НаборНаличияОригиналов.Записать(Истина);
	
	//Запись статусов документов
	НовыйСтатус 		= Неопределено;
	МассивДокументов 	= Новый Массив;

	Если ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.Подписан;
		Иначе
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.НеПодписан;
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтруктураПараметров.ВедомыйДокумент) Тогда
			МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
		Иначе
			НовыйСтатус = Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураПараметров.ВедомыйДокумент) Тогда
			МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НовыйСтатус <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		СтатусыДокумента.Статус            = НовыйСтатус;
		
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);	
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
КонецФункции

#КонецОбласти 

#Область ПоследниеДоговоры 

Функция ПолучитьПоследнийДоговор(Контрагент, Организация, ВидДоговора) Экспорт 
	
	// Если в настройках пользователя установлено получать последний договор, то пробуем найти его
	// Если в настройках флажок не установлен,либо договор не найден, то всегда проверяем, если у контрагента только один договор, то берём его
	// Иначе возвращаем Неопределено 
	
	НайденныйДоговор = ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда 
		ИмяНастройкиПользователя = "ПодставлятьПоследнийДоговорВЗатратныхДокументах";
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда 
		ИмяНастройкиПользователя = "ПодставлятьПоследнийДоговорВДоходныхДокументах";
	Иначе
		ИмяНастройкиПользователя = "";
	КонецЕсли;
	
	ПолучитьПоследний = Истина;
	Если Не ПустаяСтрока(ИмяНастройкиПользователя) Тогда
		ПолучитьПоследний = CW_Настройки.ПолучитьНастройкуПользователя( , ИмяНастройкиПользователя);
	КонецЕсли;
	
	Если ПолучитьПоследний Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              |	CW_ПоследниеИспользованныеДоговоры.Договор КАК Договор
		              |ИЗ
		              |	РегистрСведений.CW_ПоследниеИспользованныеДоговоры КАК CW_ПоследниеИспользованныеДоговоры
		              |ГДЕ
		              |	CW_ПоследниеИспользованныеДоговоры.Контрагент = &Контрагент
		              |	И CW_ПоследниеИспользованныеДоговоры.Организация = &Организация
		              |	И CW_ПоследниеИспользованныеДоговоры.ВидДоговора = &ВидДоговора";
		
		Запрос.УстановитьПараметр("Организация", 	Организация); 
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора",	ВидДоговора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.Договор;
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НайденныйДоговор) Тогда
		
		// пробуем установить единственный, если имеется, исключая помеченные на удаление и закрытые
		Запрос = Новый Запрос;
		Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               	|	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
		               	|ИЗ
		               	|	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
		               	|ГДЕ
		               	|	CW_ДоговорыПоГрузоперевозкам.Владелец = &Владелец
		               	|	И CW_ДоговорыПоГрузоперевозкам.ВидДоговора = &ВидДоговора
		               	|	И НЕ CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления
		               	|	И CW_ДоговорыПоГрузоперевозкам.Организация = &Организация
		               	|	И CW_ДоговорыПоГрузоперевозкам.Закрыт = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Организация", 	Организация); 
		Запрос.УстановитьПараметр("Владелец", 		Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора", 	ВидДоговора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			НайденныйДоговор = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли; 

	Возврат НайденныйДоговор;
	
КонецФункции 

Процедура ЗаписатьПоследнийДоговор(Договор) Экспорт 
	// --- 
	
	Регистр = РегистрыСведений.CW_ПоследниеИспользованныеДоговоры.СоздатьМенеджерЗаписи();
	Регистр.Период = ТекущаяДата();
	Регистр.Организация = Договор.Организация;
	Регистр.Контрагент = Договор.Владелец;
	Регистр.Договор = Договор;
	Регистр.ВидДоговора = Договор.ВидДоговора;
	Регистр.Записать();
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СрокиОплаты

Функция ПолучитьПланОплаты(Документ) Экспорт 
	
	Ответ = Новый Структура("Дата,Примечание",Неопределено,Неопределено);
	
	СоответствиеИмяТаблицы = ПолучитьСоответствиеИмениРегистраТипуДокумента();
	
	ИмяТаблицы = СоответствиеИмяТаблицы.Получить(ТипЗнч(Документ));
	Если ИмяТаблицы = Неопределено Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПланОплаты.ПлановаяДата КАК ПлановаяДата,
	               |	CW_ПланОплаты.Описание КАК Описание
	               |ИЗ
	               |	РегистрСведений."+ИмяТаблицы+" КАК CW_ПланОплаты
	               |ГДЕ
	               |	CW_ПланОплаты.Счет = &Счет";
	
	Запрос.УстановитьПараметр("Счет", Документ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ.Дата 			= Выборка.ПлановаяДата;
		Ответ.Примечание 	= Выборка.Описание;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции  

&НаСервере
Функция ПолучитьСоответствиеИмениРегистраТипуДокумента()
	
	Соответствие = новый Соответствие;
	
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"), "CW_ПланОплатыВходящихСчетов");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоПриобретениям"),  "CW_ПланОплатыВходящихСчетов");
	
	Соответствие.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"),  	 "CW_ПланОплатыИсходящихСчетов");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг"), "CW_ПланОплатыИсходящихСчетов");
	
	Возврат Соответствие;
	
КонецФункции


Функция ПолучитьСрокОплаты(Документ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СрокиОплатыСчетов.ДатаОплаты КАК ДатаОплаты,
	               |	CW_СрокиОплатыСчетов.Описание КАК Описание,
	               |	CW_СрокиОплатыСчетов.РучноеРедактирование КАК РучноеРедактирование
	               |ИЗ
	               |	РегистрСведений.CW_СрокиОплатыСчетов КАК CW_СрокиОплатыСчетов
	               |ГДЕ
	               |	CW_СрокиОплатыСчетов.Счет = &Счет";
	
	Запрос.УстановитьПараметр("Счет", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ответ 	= Новый Структура("ДатаОплаты,Описание,РучноеРедактирование",Дата(1,1,1),"",Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	
	Возврат(Ответ);
	
КонецФункции  

Функция УстановитьСрокОплаты(ДанныеДляЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Счет.Установить(ДанныеДляЗаписи.Счет);
	НаборЗаписей.Записать(Истина);
	
	Если ЗначениеЗаполнено(ДанныеДляЗаписи.ДатаОплаты) Или ЗначениеЗаполнено(ДанныеДляЗаписи.Описание) Тогда
		
		Запись 				= НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ДанныеДляЗаписи);
		
		Попытка
		
			НаборЗаписей.Записать(Истина);
		
		Исключение
			
			Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
		КонецПопытки; 
		
	КонецЕсли;
	
	// ---  
	ИспользоватьПланирование = Ложь;
	Если ТипЗнч(ДанныеДляЗаписи.Счет) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		ИЛИ  ТипЗнч(ДанныеДляЗаписи.Счет) = Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг") Тогда
		
		ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей");

	ИначеЕсли ТипЗнч(ДанныеДляЗаписи.Счет) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
		ИЛИ  ТипЗнч(ДанныеДляЗаписи.Счет) = Тип("ДокументСсылка.CW_РасходыПоПриобретениям") Тогда 
		
		ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам");
		
	КонецЕсли;
	
	Если ИспользоватьПланирование Тогда
		// дублируем срок оплаты через стандартный механизм БП
		СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ДанныеДляЗаписи.Счет.ВедомыйСчет, ДанныеДляЗаписи.ДатаОплаты);
	КонецЕсли;
	
	// --- 

	Возврат(_УФКС.Ответ());

КонецФункции // УстановитьСрокОплаты(СтруктураДанных)()

//Функция РассчитатьСрокОплаты(СтруктураПараметров) Экспорт
//
// Возвращает рассчитаннй срок оплаты по документу
//
// Параметры:
//  СтруктураПараметров - Структура;
//	
// Заполнение параметра "СтруктураПараметров" выполянется в функции
// ПодготовитьДанныеДляРасчетаСрокаОплаты() текущего общего модуля.
//
Функция РассчитатьСрокОплаты(СтруктураПараметров) Экспорт
	
	ДатаСтарта	= Дата(1,1,1);
	ДатаОплаты	= Дата(1,1,1);

	ПорядокРасчета 				= ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыСчета");
	ПроизводственныйКалендарь 	= ПредопределенноеЗначение("Справочник.ПроизводственныеКалендари.ПустаяСсылка");
	СпособРасчетаОтсрочки 		= 0;
	ВариантПереносаДаты			= 0;
	Отказ						= Ложь;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.Договор) 
		ИЛИ Не ЗначениеЗаполнено(СтруктураПараметров.Ссылка) Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	ПолучаемыеПараметры = "УсловияОплаты;КоличествоДнейПросрочки";
	ПараметрыДоговора 	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров,ПолучаемыеПараметры);
	
	Если Не ЗначениеЗаполнено(ПараметрыДоговора.УсловияОплаты) Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Если Не СтруктураПараметров.ЕстьСчет 
		И (ПараметрыДоговора.ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыСчета") 
			ИЛИ ПараметрыДоговора.ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыПолученияПередачиСчета"))	Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	Если Не СтруктураПараметров.ЕстьАкт И ПараметрыДоговора.ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыДоговора.УсловияОплаты) Тогда
		ПорядокРасчета 				= ПараметрыДоговора.ПорядокРасчета;
		СпособРасчетаОтсрочки 		= ПараметрыДоговора.СпособРасчетаОтсрочки;
		ПроизводственныйКалендарь 	= ПараметрыДоговора.ПроизводственныйКалендарь;
		ВариантПереносаДаты 		= ПараметрыДоговора.ВариантПереносаДаты;
	КонецЕсли;
	
	Если ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ПодключаемаяОбработка") Тогда 
		ПодключаемыйОбъект 	= ПараметрыДоговора.ПодключаемаяОбработка;
		
		Если ЗначениеЗаполнено(ПодключаемыйОбъект) Тогда
			
			Обработка = _ПО.ПолучитьОбработку(ПодключаемыйОбъект);
			
			Попытка
				
				Обработка.СсылкаНаОбъект 	= СтруктураПараметров.Ссылка;
				Результат					= Обработка.ВыполнитьКоманду(Новый Структура("ПодключаемыйОбъект",ПодключаемыйОбъект));
				
				Ошибка = Ложь;
				Результат.Свойство("Ошибка", Ошибка);
				Ошибка = ?(Ошибка=Неопределено, ложь, Ошибка);
				
				Если Ошибка Тогда
					ТекстСообщения =  "Не удалось рассчитать срок оплаты для <" + СтруктураПараметров.Ссылка + ">: " + Результат.ОписаниеОшибки;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
				
				Если НЕ Отказ Тогда
					Результат.Свойство("ДатаОплаты", ДатаОплаты);
					ДатаОплаты = ?(ДатаОплаты=Неопределено, Дата(1,1,1), ДатаОплаты);
				КонецЕсли;
				
			Исключение
				ТекстСообщения =  "Не удалось рассчитать срок оплаты для <" + СтруктураПараметров.Ссылка + ">: " + Результат.ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки; 
			
		КонецЕсли; 
		
		Возврат ДатаОплаты;
		
	КонецЕсли; 
		
	Если СтруктураПараметров.ЕстьСчет Тогда
		Если ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыСчета") Тогда
			ДатаСтарта = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаСчета),СтруктураПараметров.ДатаСчета, СтруктураПараметров.Дата);
		КонецЕсли;
		Если ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыПолученияПередачиСчета") Тогда
			СтруктураДанных	= ПолучитьПризнакНаличияИДатуВозвратаОригиналов(СтруктураПараметров.Ссылка);
			ДатаСтарта		= СтруктураДанных.ДатаПолучения;
		КонецЕсли;
	КонецЕсли;
		
	Если СтруктураПараметров.ЕстьАкт И ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		СтруктураДанных	= ПолучитьПризнакНаличияИДатуВозвратаОригиналов(СтруктураПараметров.Ссылка);
		ДатаСтарта		= СтруктураДанных.ДатаПолучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСтарта) Тогда
		Если СпособРасчетаОтсрочки = 0 Тогда
			//по календраным дням
			Если ВариантПереносаДаты = 0 Тогда
				ДатаОплаты = ДатаСтарта + 24*3600 * ПараметрыДоговора.КоличествоДнейПросрочки;
			Иначе
				ДатаОплаты = ПолучитьДатуПоКоличествуРабочихДней(ДатаСтарта, ПроизводственныйКалендарь, ПараметрыДоговора.КоличествоДнейПросрочки, СпособРасчетаОтсрочки, ВариантПереносаДаты);
			КонецЕсли;
		Иначе
			//По рабочим дням
			ДатаОплаты = ПолучитьДатуПоКоличествуРабочихДней(ДатаСтарта, ПроизводственныйКалендарь, ПараметрыДоговора.КоличествоДнейПросрочки, СпособРасчетаОтсрочки, ВариантПереносаДаты);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаОплаты;
	
КонецФункции // РассчитатьСрокОплаты()

Функция ПолучитьДатуПоКоличествуРабочихДней(ДатаСтарта, ПроизводственныйКалендарь, КоличествоДней, СпособРасчетаОтсрочки, ВариантПереносаДаты)
	
	КоличествоДней = ?(	КоличествоДней = 0, 1,	КоличествоДней);
	
	мВидыДней = Новый Массив;
	мВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий"));
	мВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный"));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ "+Формат(КоличествоДней,"ЧГ=0")+"
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
	|ПОМЕСТИТЬ ВТ_ДниОтсрочки
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	//УсловиеВидыДней
	|	И ДанныеПроизводственногоКалендаря.Дата > &ДатаСтарта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.УстановитьПараметр("ДатаСтарта", НачалоДня(ДатаСтарта));
	Запрос.УстановитьПараметр("мВидыДней", 	мВидыДней);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	
	Если СпособРасчетаОтсрочки = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВидыДней", "И ДанныеПроизводственногоКалендаря.ВидДня В(&мВидыДней)");	
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ДниОтсрочки.Дата КАК Дата,
	|  ВТ_ДниОтсрочки.ВидДня КАК ВидДня
	|ИЗ
	|	ВТ_ДниОтсрочки КАК ВТ_ДниОтсрочки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСтарта 		= Выборка.Дата;
		ТекущийВидДня 	= Выборка.ВидДня;
	КонецЕсли;
	
	Если СпособРасчетаОтсрочки = 1 Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	Если СпособРасчетаОтсрочки = 0 Тогда
		//по календарным дням с переносм дней
		
		Если ВариантПереносаДаты = 1 Тогда
			
			Если мВидыДней.Найти(ТекущийВидДня) <> Неопределено Тогда
				//уже ваыпало на рабочий день
				Возврат ДатаСтарта;
			КонецЕсли;
			
			//На следующий рабочий день
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
			|ГДЕ
			|	ДанныеПроизводственногоКалендаря.Дата > &НоваяДатаСтарта
			|	И ДанныеПроизводственногоКалендаря.ВидДня В(&мВидыДней)
			|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			
			Запрос.УстановитьПараметр("НоваяДатаСтарта", НачалоДня(ДатаСтарта));
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Дата;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВариантПереносаДаты = 2 Тогда
			//На предыдущий рабочий день
			
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВТ_ДниОтсрочки.Дата КАК Дата
			|ИЗ
			|	ВТ_ДниОтсрочки КАК ВТ_ДниОтсрочки
			|ГДЕ
			|	ВТ_ДниОтсрочки.ВидДня В (&мВидыДней)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Дата;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;
	
	Возврат ДатаСтарта;
	
КонецФункции

//Функция ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект) Экспорт
//
// Возвращает структуру с данными необходимыми для расчета срока оплаты по
// в соответсвии с условиями договора;
//
// Параметры:
//		Объект - объект формы из которой выполянеся вызов
//
Функция ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект) Экспорт
	
	ДоходыРасходы = ТипЗнч(Объект.Ссылка)= Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
					ИЛИ ТипЗнч(Объект.Ссылка)= Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураВозврата.Вставить("Дата"		, Объект.Дата);
	СтруктураВозврата.Вставить("Договор"	, Объект.Договор);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПриложениеКДоговору", Объект.Ссылка.Метаданные()) Тогда
		СтруктураВозврата.Вставить("ПриложениеКДоговору" , Объект.ПриложениеКДоговору);
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ДатаСчета"	, Объект.ДатаСчета);
	СтруктураВозврата.Вставить("ЕстьСчет"	, ?(ДоходыРасходы, Объект.ФормируетсяСчет, 	Объект.ПредъявленСчет));
	СтруктураВозврата.Вставить("ЕстьАкт"	, ?(ДоходыРасходы, Объект.ФормируетсяАкт,	Объект.ПредъявленАкт));
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти 

#Область Последовательности 

Процедура ПеренестиПризнакВосстановленияПоследовательности(ОбъектИсточник,ОбъектПриемник) Экспорт 
	// --- 
	
	ТекущийПризнак = _сф.ст_ПолучитьСвойство(ОбъектИсточник.ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ТекущийПризнак <> Неопределено) Тогда
		Если (ТекущийПризнак = Истина) Тогда
			_сф.ст_УстановитьСвойство(ОбъектПриемник.ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности",ТекущийПризнак);		
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти

#Область КоличествоВтабличнуюЧасть

//Функция ПолучитьПараметрДляПодстановкиЗначенияВКоличество() Экспорт
//
// Получение парамтера грузоперевозки для подстановки его значения в поле "Количество" 
//  документов ДОходы по грузоперевозкам и Расходы по грузопереовзкам
//
// Параметры функции
// 	СтруктураПараметров - струкутура парамтродя для подстанвоки в запрос.
//
// Поля стуркутры:
// 		ТипПеревозки,Номенклатура,ЕдиницаИзмерения
//
Функция ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров) Экспорт
	
	//Проерим наличие даныне в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ТипПеревозки КАК ТипПеревозки,
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Номенклатура КАК Номенклатура,
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ПараметрГрузоперевозки КАК ПараметрГрузоперевозки
		|ИЗ
		|	РегистрСведений.CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки КАК CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокНоменклатуры = Новый Массив;
	СписокНоменклатуры.Добавить(СтруктураПараметров.Номенклатура);   
	
	
	МассивТипПеревозки = Новый Массив;
	МассивТипПеревозки.Добавить(Справочники.CW_ТипыПеревозок.ПустаяСсылка());
	МассивТипПеревозки.Добавить(СтруктураПараметров.ТипПеревозки);
	
	МассивЕдиницаИзмерения = Новый Массив;
	МассивЕдиницаИзмерения.Добавить(Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	МассивЕдиницаИзмерения.Добавить(СтруктураПараметров.ЕдиницаИзмерения);
	
	//Проерим наличие групп номеклатуры в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки КАК CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки
		|ГДЕ
		|	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Номенклатура.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();

	ЕстьГруппыНоменгклатуры = Не РезультатЗапроса.Пустой(); 
	
	ТаблицаИерархии = Новый ТаблицаЗначений;
	ТаблицаИерархии.Колонки.Добавить("Элемент"	,	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИерархии.Колонки.Добавить("Родитель"	,	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаИерархии.Колонки.Добавить("Уровень"	,	ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	//Подготовка данных для формирвоания запроса
	Если ЕстьГруппыНоменгклатуры Тогда
		
		СоответствиеЭлементовИГрупп = ОбщегоНазначенияБПВызовСервера.ПолучитьСписокВышеСтоящихГруппЭлементов(СписокНоменклатуры);
		
		Для каждого Номенклатура Из СписокНоменклатуры Цикл
			
			НоваяСтрока = ТаблицаИерархии.Добавить();
			НоваяСтрока.Элемент		= Номенклатура;
			
			НоваяСтрока = ТаблицаИерархии.Добавить();
			НоваяСтрока.Элемент		= Номенклатура;
			НоваяСтрока.Родитель	= Номенклатура;
			
			СписокГрупп = СоответствиеЭлементовИГрупп.Получить(Номенклатура);
			Если СписокГрупп = Неопределено Тогда
				НоваяСтрока.Уровень = 1;
				Продолжить;
			КонецЕсли;
			
			КоличествоВышеСтоящихГрупп = СписокГрупп.Количество();
			
			НоваяСтрока.Уровень = КоличествоВышеСтоящихГрупп + 1;
			
			Для Индекс = 1 По КоличествоВышеСтоящихГрупп Цикл
				НоваяСтрока = ТаблицаИерархии.Добавить();
				НоваяСтрока.Элемент	= Номенклатура;
				НоваяСтрока.Родитель= СписокГрупп[Индекс - 1];
				НоваяСтрока.Уровень	= КоличествоВышеСтоящихГрупп - Индекс + 1;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого Номенклатура Из СписокНоменклатуры Цикл
			
			ВидНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,	"ВидНоменклатуры");
			
			НоваяСтрока = ТаблицаИерархии.Добавить();
			НоваяСтрока.Элемент		= Номенклатура;
			
			НоваяСтрока = ТаблицаИерархии.Добавить();
			НоваяСтрока.Элемент		= Номенклатура;
			НоваяСтрока.Родитель	= Номенклатура;
			НоваяСтрока.Уровень = 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаИерархии.Добавить();	// Корень

	МассивНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаИерархии, "Родитель", Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивТипПеревозки"		,	МассивТипПеревозки);
	Запрос.УстановитьПараметр("МассивЕдиницаИзмерения"	,	МассивЕдиницаИзмерения);
	Запрос.УстановитьПараметр("МассивНоменклатуры"		,	МассивНоменклатуры);
	Запрос.УстановитьПараметр("ТаблицаИерархии"			,	ТаблицаИерархии);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаИерархии.Элемент КАК Элемент,
	               |	ТаблицаИерархии.Родитель КАК Родитель,
	               |	ТаблицаИерархии.Уровень КАК Уровень
	               |ПОМЕСТИТЬ ВТТаблицаИерархии
	               |ИЗ
	               |	&ТаблицаИерархии КАК ТаблицаИерархии
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаИерархии.Элемент КАК Элемент,
	               |	ТаблицаИерархии.Родитель КАК Родитель,
	               |	ТаблицаИерархии.Уровень КАК Уровень
	               |ПОМЕСТИТЬ ВТТаблицаИерархииСВидами
	               |ИЗ
	               |	ВТТаблицаИерархии КАК ТаблицаИерархии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ТаблицаИерархии.Элемент = Номенклатура.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаИерархии.Элемент КАК Номенклатура,
	               |	ТаблицаИерархии.Родитель КАК Родитель,
	               |	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ТипПеревозки КАК ТипПеревозки,
	               |	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТаблицаИерархии.Уровень КАК Уровень,
	               |	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ПараметрГрузоперевозки КАК ПараметрГрузоперевозки
	               |ИЗ
	               |	ВТТаблицаИерархииСВидами КАК ТаблицаИерархии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки КАК CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки
	               |		ПО ТаблицаИерархии.Родитель = CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Номенклатура
	               |ГДЕ
	               |	CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Номенклатура В(&МассивНоменклатуры)
	               |	И CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ТипПеревозки В(&МассивТипПеревозки)
	               |	И CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ЕдиницаИзмерения В(&МассивЕдиницаИзмерения)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Уровень УБЫВ,
	               |	ТипПеревозки УБЫВ,
	               |	Номенклатура УБЫВ,
	               |	ЕдиницаИзмерения УБЫВ";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ПараметрГрузоперевозки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Контроль_Услуг_По_Протоколу

//ПроверитьСоответствиеУслугПоДоговору(МассивУслугДоговора, ТаблицаУслуг, Отказ)
//	Вызывается из документов "Доходы по грузоперевозке" и "расходы по груопереовзке" перед их записью
//
//	Контроль услуг по документу на соответствие протоколу согласования цен.
//
//	Параметры:
// 		МассивУслугДоговора - массив услуг по протоколу согласоавния цен;
// 		ТаблицаУслуг 		- Таблица "Услуги" проверяемого документа;
//		Отказ				- в случае сли какая либо услуга документа 
//							отсутствует в масиве услуг, в параметр передается ИСТИНА
//
Процедура ПроверитьСоответствиеУслугПоДоговору(МассивУслугДоговора, МассивУслугиДокумента, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК УслугаДоговора
	               |ПОМЕСТИТЬ ВТ_УслугиПоДоговору
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В(&МассивУслугДоговора)
	               |	И НЕ Номенклатура.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	УслугаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_УслугиДокумента
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В(&МассивУслугиДокумента)
	               |	И НЕ Номенклатура.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Номенклатура.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивУслугДоговора" 	, МассивУслугДоговора);	
	Запрос.УстановитьПараметр("МассивУслугиДокумента"	, МассивУслугиДокумента);	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_УслугиДокумента.Номенклатура КАК Номенклатура,
	               |	ПРЕДСТАВЛЕНИЕ(ВТ_УслугиДокумента.Номенклатура) КАК НоменклатураПредставление,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиПоДоговору.УслугаДоговора ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьВПротоколе
	               |ПОМЕСТИТЬ ВТ_Контроль
	               |ИЗ
	               |	ВТ_УслугиДокумента КАК ВТ_УслугиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиПоДоговору КАК ВТ_УслугиПоДоговору
	               |		ПО ВТ_УслугиДокумента.Номенклатура = ВТ_УслугиПоДоговору.УслугаДоговора";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_УслугиПоДоговору";
	Запрос.Выполнить();
		
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_УслугиДокумента";
	Запрос.Выполнить();
	
	Запрос.Текст  = "ВЫБРАТЬ
	               |	ВТ_Контроль.Номенклатура КАК Номенклатура,
	               |	ВТ_Контроль.НоменклатураПредставление КАК НоменклатураПредставление,
	               |	ВТ_Контроль.ЕстьВПротоколе КАК ЕстьВПротоколе
	               |ИЗ
	               |	ВТ_Контроль КАК ВТ_Контроль
	               |ГДЕ
	               |	НЕ ВТ_Контроль.ЕстьВПротоколе";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Выборка.НоменклатураПредставление +" отсутствует в протоколе согласования цен!";
			Сообщение.Сообщить();
	
		КонецЦикла;
		
		Отказ = Истина;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//Заполнение документов
Процедура ЗаполнениеДокументов(Объект) Экспорт
	
	Если Объект.Дата = Дата(1,1,1) Тогда
		Объект.Дата = CW_Настройки.ТекущаяДатаПользователя();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Организация") Тогда
		Если Объект.Организация.Пустая() Тогда
			Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Ответственный") Тогда
		Если Объект.Ответственный.Пустая() Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Заполнение документов

Процедура УстановитьПараметрыФункциональныхОпцийФормы(Форма) Экспорт  
	
	ГруппаПользователя 		 = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	УстанавилваемыеПараметры = Новый Структура;
	УстанавилваемыеПараметры.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(УстанавилваемыеПараметры);
	
КонецПроцедуры
	

Функция НужноПоказатьПередКорректировкой(Объект) Экспорт 
	
	Если НЕ Объект.Корректировка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Объект.КорректируемыйДокумент.Корректировка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки")
		И Объект.КорректируемыйДокумент.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 


Процедура ПередЗаписьюНаСервере(Форма, Отказ) Экспорт

	Объект 				= Форма.Объект;
	МетаданныеОбъекта 	= Объект.Ссылка.Метаданные();
	
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеОбъекта) Тогда 
		Возврат;
	КонецЕсли;
	
	ДоговорПоГрузоперевозке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Договор");
	Если ТипЗнч(ДоговорПоГрузоперевозке) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		ПроверитьСоответствиедоговораУчетному(ДоговорПоГрузоперевозке, Отказ)	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСоответствиедоговораУчетному(ДоговорПоГрузоперевозке, Отказ = Ложь) Экспорт
	
	Если Не ДоговорПоГрузоперевозке.БухгалтерскийУчет Тогда
		//Ничего не делаем
		Возврат;
	КонецЕсли;     
	
	УчетныйДоговор = ДоговорПоГрузоперевозке.УчетныйДоговор;
	
	Если ДоговорПоГрузоперевозке.БухгалтерскийУчет 
		и Не ЗначениеЗаполнено(УчетныйДоговор) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для договора "+СокрЛП(ДоговорПоГрузоперевозке)+" не указан учётный договор!",,,,Отказ);
		Возврат;
	КонецЕсли;   
	
	Если ДоговорПоГрузоперевозке.ВалютаДоговора <> УчетныйДоговор.ВалютаВзаиморасчетов Тогда 
		ОбщегоНазначения.СообщитьПользователю("Валюта договора по грузоперевозке ("+ДоговорПоГрузоперевозке.ВалютаДоговора+") отличается от валюты учетного договора ("+УчетныйДоговор.ВалютаВзаиморасчетов +")!",,,,Отказ);
	КонецЕсли;
	
	Если ДоговорПоГрузоперевозке.Владелец <> УчетныйДоговор.Владелец Тогда 
		ОбщегоНазначения.СообщитьПользователю("Контрагент договора по грузоперевозке ("+ ДоговорПоГрузоперевозке.Владелец+") отличается от контрагента учетного договора ("+УчетныйДоговор.Владелец+")!",,,,Отказ);
	КонецЕсли;
	
	Если ДоговорПоГрузоперевозке.ВидДоговора <> УчетныйДоговор.ВидДоговора Тогда 
		ОбщегоНазначения.СообщитьПользователю("Вид договора по грузоперевозке ("+ДоговорПоГрузоперевозке.ВидДоговора+") отличается от учетного договора ("+УчетныйДоговор.ВидДоговора+")!",,,,Отказ);
	КонецЕсли;
	
	Если ДоговорПоГрузоперевозке.ВалютаДоговора <> Константы.ВалютаРегламентированногоУчета.Получить() 
		И ДоговорПоГрузоперевозке.ВзаиморасчетыВУЕ <> УчетныйДоговор.РасчетыВУсловныхЕдиницах Тогда 
		ОбщегоНазначения.СообщитьПользователю("Признак ""Взаиморасчеты в у.е."" отличается от учетного договора ("+УчетныйДоговор.ВидДоговора+")!",,,,Отказ);
	КонецЕсли;
	
	//Для версии КОРП 
	ОрганизацияДоговора = ДоговорПоГрузоперевозке.Организация;
	Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда 	 
		ОрганизацияДоговора = ДоговорПоГрузоперевозке.Организация.ГоловнаяОрганизация;
	КонецЕсли;
	//КОНЕЦ Для версии КОРП     
	
	Если ОрганизацияДоговора <> УчетныйДоговор.Организация Тогда 
		ОбщегоНазначения.СообщитьПользователю("Организация договора по грузоперевозке ("+ ОрганизацияДоговора+") отличается от организации учетного договора ("+УчетныйДоговор.Организация+")!",,,,Отказ);
	КонецЕсли;    
	
	
КонецПроцедуры


Функция ПолучитьПлановыйСрокОплаты(ПараметрКоманды, ПлатежныйКалендарь, СоответствиеОстатков = Неопределено) Экспорт

	Если СоответствиеОстатков <> Неопределено Тогда
		ЕстьОстатокЗадолженности = СоответствиеОстатков.Получить(ПараметрКоманды);
		Если ЕстьОстатокЗадолженности = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;                              
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДанныеПлатежногоКалендаря.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПлатежныеДаты
	|ИЗ
	|	РегистрСведений.CW_ДанныеПлатежногоКалендаря КАК CW_ДанныеПлатежногоКалендаря
	|ГДЕ
	|	CW_ДанныеПлатежногоКалендаря.ПлатежныйКалендарь = &ПлатежныйКалендарь
	|	И CW_ДанныеПлатежногоКалендаря.Дата >= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("ПлатежныйКалендарь", ПлатежныйКалендарь);     
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата());     
	
	Запрос.Выполнить();
	
	ДанныеСрокаОплаты 	= CW_Документы.ПолучитьСрокОплаты(ПараметрКоманды);
	Если ДанныеСрокаОплаты.ДатаОплаты > НачалоДня(ТекущаяДата()) Тогда  
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ПлатежныеДаты.Дата КАК Дата
		|ИЗ
		|	ВТ_ПлатежныеДаты КАК ВТ_ПлатежныеДаты
		|ГДЕ
		|	ВТ_ПлатежныеДаты.Дата <= &СрокОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("СрокОплаты", НачалоДня(ДанныеСрокаОплаты.ДатаОплаты));  	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			ДатаСрокОплаты = Выборка.Дата;
		КонецЕсли; 
		
	КонецЕсли;   
	
	Если ДатаСрокОплаты = Неопределено   
		ИЛИ ДанныеСрокаОплаты.ДатаОплаты <= НачалоДня(ТекущаяДата()) Тогда   
	
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ПлатежныеДаты.Дата КАК Дата
		|ИЗ
		|	ВТ_ПлатежныеДаты КАК ВТ_ПлатежныеДаты
		|ГДЕ
		|	ВТ_ПлатежныеДаты.Дата >= &СрокОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата ВОЗР
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("СрокОплаты", НачалоДня(ТекущаяДата()));  	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			ДатаСрокОплаты = Выборка.Дата;
		КонецЕсли; 
		
	КонецЕсли;    
 	
	Возврат ДатаСрокОплаты;
	
КонецФункции  

Процедура ЗаписатьДанныеПервичногоДокумента(Объект) Экспорт
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Ссылка",		Объект.Ссылка);
	ДанныеДокумента.Вставить("Организация",	Объект.Организация);
	ДанныеДокумента.Вставить("Контрагент",  Объект.Контрагент);
	
	//Исключем дублирование записей
	РегистрыСведений.CW_ДанныеПервичныхДокументов.ОчиститьНаборПоУсловиям(ДанныеДокумента);
	
	Если Объект.ФормируетсяСчет Тогда 
		НомерДляПечати 	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчета, Объект.ДатаСчета));	
		РегистрыСведений.CW_ДанныеПервичныхДокументов.ЗаписатьДанныеПервичногоДокумента(ДанныеДокумента, Перечисления.CW_ВидыПервичныхДокументов.Счет, НомерДляПечати, Объект.НомерСчета, Объект.ДатаСчета);
	КонецЕсли;
	
	Если Объект.ФормируетсяАкт Тогда
		НомерДляПечати 	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерАкта, Объект.ДатаАкта));	 
		РегистрыСведений.CW_ДанныеПервичныхДокументов.ЗаписатьДанныеПервичногоДокумента(ДанныеДокумента, Перечисления.CW_ВидыПервичныхДокументов.Акт, НомерДляПечати, Объект.НомерАкта, Объект.ДатаАкта);
	КонецЕсли;
	
	Если Объект.ФормируетсяСчетФактура Тогда
		НомерДляПечати 	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры));	 
		РегистрыСведений.CW_ДанныеПервичныхДокументов.ЗаписатьДанныеПервичногоДокумента(ДанныеДокумента, Перечисления.CW_ВидыПервичныхДокументов.СчетФактура, НомерДляПечати, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтавкуНДС(ПараметрыФункции) Экспорт
	
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый. ПолучитьСтавкуНДС(ПараметрыФункции);

КонецФункции


Процедура ПроверитьСрокДействияДоговора(Объект, СтруктураПараметров, Отказ) Экспорт  
	
	Если СтруктураПараметров.КонтролироватьСрокДоговоров 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Договор")
		И ЗначениеЗаполнено(Объект.Договор) 
		И НЕ Объект.Договор.Пролонгация Тогда
		
		Если ЗначениеЗаполнено(Объект.Договор.СрокДействияДоговора)
			И Объект.Дата > КонецДня(Объект.Договор.СрокДействияДоговора) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Объект.Ссылка)+": дата документа больше даты окончания действия договора!",,,,Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если СтруктураПараметров.КонтролироватьСрокПриложения
		И ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПриложениеКДоговору") 
		И ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
		
		Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору.СрокДействия)
			И Объект.Дата > КонецДня(Объект.ПриложениеКДоговору.СрокДействия) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Объект.Ссылка)+": дата документа больше даты окончания действия приложения к договору!",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

Функция ПустаяСтруктураКонтроляСрокаДействияДоговора() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("КонтролироватьСрокДоговоров", 	Ложь);
	Структура.Вставить("КонтролироватьСрокПриложения", Ложь);
	
	Возврат Структура;

КонецФункции
